CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_tzpcu.c
/*!
    \file    gd32w51x_tzpcu.c
    \brief   TZPCU driver

    \version 2021-03-25, V1.0.0, firmware for GD32W51x
*/

/*
    Copyright (c) 2021, GigaDevice Semiconductor Inc.

    Redistribution and use in source and binary forms, with or without modification, 
are permitted provided that the following conditions are met:

    1. Redistributions of source code must retain the above copyright notice, this 
       list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, 
       this list of conditions and the following disclaimer in the documentation 
       and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors 
       may be used to endorse or promote products derived from this software without 
       specific prior written permission.

    THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" 
AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED 
WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE DISCLAIMED. 
IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, 
INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT 
NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES; LOSS OF USE, DATA, OR 
PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY, 
WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) 
ARISING IN ANY WAY OUT OF THE USE OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY 
OF SUCH DAMAGE.
*/

#include "gd32w51x_tzpcu.h"


#define LSB_16BIT_MASK                     ((uint16_t)0xFFFFU)      /*!< LSB 16-bit mask */
#define PERIPH_LOCATION_MASK               ((uint32_t)0x00200000U)  /*!< peripherals location mask */
#define PERIPH_REGNUM_POS                  28U 
#define TZSPC_SAM0_ADDR                    ((TZSPC) + 0x00000010U)
#define TZSPC_PAM0_ADDR                    ((TZSPC) + 0x00000020U)

/* definitions for TZPCU TZSPC all peripherals register values */
#define TZSPC_PERIPH_CFG0_ALL              (0xC400CDDFU)
#define TZSPC_PERIPH_CFG1_ALL              (0x0001FF9AU)
#define TZSPC_PERIPH_CFG2_ALL              (0xFC800000U)
#define TZSPC_PERIPH_PAMCFG2_ALL           (0xFE800000U)
#define EXT_MEM_SIZE                       (0x08000000U)            /*!< QSPI flash and SQPI PSRAM are both 128M */
#define START_ADDRESS_POS                  0U
#define START_ADDRESS_MASK                 (0x00003FFFU)
#define LENGTH_POS                         16U
#define PERIPH_OFFSET                      16U
#define LENGTH_MASK                        (0x7FFF0000U)
#define TZIAC_INTEN0_ALL                   (0xC400CDDFU)
#define TZIAC_INTEN1_ALL                   (0x1EF9FF9AU)
#define TZIAC_INTEN2_ALL                   (0xFF800FF3U)

/*!
    \brief      configure peripherals secure attributes
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_DBG: DBG peripheral(only for privilege attributes)
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral
      \arg        TZPCU_PERIPH_ALL: all peripherals
    \param[in]  attributes: security and privilege attributes
                one or more parameters can be selected which are shown as below:
      \arg        TZPCU_SEC or TZPCU_NSEC: peripheral secure attributes is secure or non-secure
      \arg        TZPCU_PRIV or TZPCU_NPRIV: peripheral privilege attributes is privilege or non-privilege
    \param[out] none
    \retval     none
*/
void tzpcu_tzspc_peripheral_attributes_config(uint32_t periph, uint32_t attributes)
{
    uint32_t position = 0U, reg_value = 0U;

    if(TZPCU_PERIPH_ALL == (periph & TZPCU_PERIPH_ALL)){
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
        /* secure configuration */
        if(TZPCU_SEC == (attributes & TZPCU_SEC)){
            TZPCU_TZSPC_SAM_CFG0 |= TZSPC_PERIPH_CFG0_ALL;
            TZPCU_TZSPC_SAM_CFG1 |= TZSPC_PERIPH_CFG1_ALL;
            TZPCU_TZSPC_SAM_CFG2 |= TZSPC_PERIPH_CFG2_ALL;
        }else{
            if(TZPCU_NSEC == (attributes & TZPCU_NSEC)){
                TZPCU_TZSPC_SAM_CFG0 &= ~TZSPC_PERIPH_CFG0_ALL;
                TZPCU_TZSPC_SAM_CFG1 &= ~TZSPC_PERIPH_CFG1_ALL;
                TZPCU_TZSPC_SAM_CFG2 &= ~TZSPC_PERIPH_CFG2_ALL;
            }
        }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
        
