CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_tzpcu.c
        /* privilege configuration */
        if(TZPCU_PRIV == (attributes & TZPCU_PRIV)){
            TZPCU_TZSPC_PAM_CFG0 |= TZSPC_PERIPH_CFG0_ALL;
            TZPCU_TZSPC_PAM_CFG1 |= TZSPC_PERIPH_CFG1_ALL;
            TZPCU_TZSPC_PAM_CFG2 |= TZSPC_PERIPH_PAMCFG2_ALL;
        }else{
            if(TZPCU_NPRIV == (attributes & TZPCU_NPRIV)){
                TZPCU_TZSPC_PAM_CFG0 &= ~TZSPC_PERIPH_CFG0_ALL;
                TZPCU_TZSPC_PAM_CFG1 &= ~TZSPC_PERIPH_CFG1_ALL;
                TZPCU_TZSPC_PAM_CFG2 &= ~TZSPC_PERIPH_PAMCFG2_ALL;
            }
        }
    }else{
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
        if(TZPCU_PERIPH_DBG != periph){
            /* get TZSPC_SAM_CFG register value */
            reg_value = REG32(TZSPC_SAM0_ADDR + ((periph >> PERIPH_REGNUM_POS) << 2U));
            position = periph & LSB_16BIT_MASK;
            if(periph & PERIPH_LOCATION_MASK){
                position = position << PERIPH_OFFSET;
            }

            /* secure configuration */
            if(TZPCU_SEC == (attributes & TZPCU_SEC)){
                reg_value |= position;
            }else if(TZPCU_NSEC == (attributes & TZPCU_NSEC)){
                reg_value &= ~position;
            }

            /* set TZSPC_SAM_CFG register value */
            REG32(TZSPC_SAM0_ADDR + ((periph >> PERIPH_REGNUM_POS) << 2U)) = reg_value;
        }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

        /* get TZSPC_PAM_CFG register value */
        reg_value = REG32(TZSPC_PAM0_ADDR + ((periph >> PERIPH_REGNUM_POS ) << 2U));
        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

        /* privilege configuration */
        if(TZPCU_PRIV == (attributes & TZPCU_PRIV)){
            reg_value |= position;
        }else{
          if(TZPCU_NPRIV == (attributes & TZPCU_NPRIV)){
            reg_value &= ~position;
          }
        }

        /* set TZSPC_PAM_CFG register value */
        REG32(TZSPC_PAM0_ADDR + ((periph >> PERIPH_REGNUM_POS ) << 2U)) = reg_value;
    }
}

/*!
    \brief      get peripherals secure attributes
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_DBG: DBG peripheral(only for privilege attributes)
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral
    \param[out] none
    \retval     peripheral attributes: TZPCU_SEC/TZPCU_NSEC or TZPCU_PRIV/TZPCU_NPRIV
*/
uint32_t tzpcu_tzspc_peripheral_attributes_get(uint32_t periph)
{
    uint32_t position = 0U, reg_value = 0U, attributes = 0U;
    
#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
    if(TZPCU_PERIPH_DBG != periph){
        /* get TZSPC_SAM_CFG register value */
        reg_value = REG32(TZSPC_SAM0_ADDR + ((periph >> PERIPH_REGNUM_POS) << 2U));
        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

        /* secure configuration */
        if(0U != (reg_value & position)){
            attributes |= TZPCU_SEC;
        }else{
            attributes |= TZPCU_NSEC;
        }
    }
#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */
        
    /* get TZSPC_PAM_CFG register value */
    reg_value = REG32(TZSPC_PAM0_ADDR + ((periph >> PERIPH_REGNUM_POS ) << 2U));
    position = periph & LSB_16BIT_MASK;
    if(periph & PERIPH_LOCATION_MASK){
        position = position << PERIPH_OFFSET;
    }

    /* privilege configuration */
    if(0U != (reg_value & position)){
        attributes |= TZPCU_PRIV;
    }else{
        attributes |= TZPCU_NPRIV;
    }
    return attributes;
}

#if defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3)
/*!
    \brief      initialize the TZPCU non-secure mark struct with the default values
    \param[in]  none
    \param[out] init_struct:
                  memory_type: QSPI_FLASH_MEM or SQPI_PSRAM_MEM
                  region_number: NON_SECURE_MARK_REGION0, NON_SECURE_MARK_REGION1, NON_SECURE_MARK_REGION2 or NON_SECURE_MARK_REGION3
                  start_address: external memory non-secure area start address
                  length: external memory non-secure area length
    \retval     none
*/
void tzpcu_non_secure_mark_struct_para_init(tzpcu_non_secure_mark_struct* init_struct)
{
    /* set the TZPCU non-secure mark struct with the default values */
    init_struct->memory_type         = QSPI_FLASH_MEM;
    init_struct->region_number       = NON_SECURE_MARK_REGION0;
    init_struct->start_address       = 0U;
    init_struct->length              = 0U;
}

/*!
    \brief      configure external memory non-secure mark
    \param[in]  p_non_secure_mark:
                  memory_type: QSPI_FLASH_MEM or SQPI_PSRAM_MEM
                  region_number: NON_SECURE_MARK_REGION0, NON_SECURE_MARK_REGION1, NON_SECURE_MARK_REGION2 or NON_SECURE_MARK_REGION3
                  start_address: external memory non-secure area start address
                  length: external memory non-secure area length
    \param[out] none
    \retval     ErrStatus: ERROR or SUCCESS
*/
ErrStatus tzpcu_tzspc_emnsm_config(tzpcu_non_secure_mark_struct *p_non_secure_mark)
{
    uint32_t reg_value, reg_address;

