CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_tzpcu.c
    if(QSPI_FLASH_MEM == p_non_secure_mark->memory_type){
        /* set TZSPC_TZMMPC0_NSMR0 address to reg_address */
        reg_address = (uint32_t)(&TZPCU_TZSPC_TZMMPC0_NSM0);
    }else if(SQPI_PSRAM_MEM == p_non_secure_mark->memory_type){
        /* set TZSPC_TZMMPC1_NSMR0 address to reg_address */
        reg_address = (uint32_t)(&TZPCU_TZSPC_TZMMPC1_NSM0);
    }

    if((p_non_secure_mark->start_address + p_non_secure_mark->length) > EXT_MEM_SIZE){
        return ERROR;
    }

    reg_value = ((p_non_secure_mark->start_address / EXT_MEM_GRANULARITY) << START_ADDRESS_POS) & START_ADDRESS_MASK;
    reg_value |= ((p_non_secure_mark->length / EXT_MEM_GRANULARITY) << LENGTH_POS) & LENGTH_MASK;
    
    REG32(reg_address + ((p_non_secure_mark->region_number) << 2U)) = reg_value;

    return SUCCESS;
}

/*!
    \brief      lock TZSPC items
    \param[in]  none
    \param[out] none
    \retval     none
*/
void tzpcu_tzspc_items_lock(void)
{
    uint32_t reg_value;

    /* get TZSPC control register value */
    reg_value = TZPCU_TZSPC_CTL;
    reg_value |= TZPCU_TZSPC_CTL_LK;

    /* set TZSPC control register value */
    TZPCU_TZSPC_CTL = reg_value;
}

/*!
    \brief      configure debug type
    \param[in]  dbg_type: debug type
                only one parameter can be selected which is shown as below:
      \arg        INVASIVE_DEBUG: invasive debug
      \arg        NON_INVASIVE_DEBUG: non-invasive debug
      \arg        SECURE_INVASIVE_DEBUG: secure invasive debug
      \arg        SECURE_NON_INVASIVE_DEBUG: secure non-Invasive debug
    \param[in]  config_value: ENABLE or DISABLE
    \param[out] none
    \retval     none
*/
void tzpcu_tzspc_dbg_config(uint32_t dbg_type, ControlStatus config_value)
{
    uint32_t reg_value;

    /* get TZSPC debug configuration register */
    reg_value = TZPCU_TZSPC_DBG_CFG;
    if(ENABLE == config_value){
        reg_value |= dbg_type;
    }else{
        reg_value &= ~dbg_type;
    }

    /* set TZSPC debug configuration register */
    TZPCU_TZSPC_DBG_CFG = reg_value;
}

#endif /* defined(__ARM_FEATURE_CMSE) && (__ARM_FEATURE_CMSE == 3) */

/*!
    \brief      lock the control register of the TZBMPC sub-block
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_lock(uint32_t tzbmpx)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);
    reg_value |= TZPCU_TZBMPC_CTL_LK;

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure default security state
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  sec_state: security state
                only one parameter can be selected which is shown as below:
      \arg        DEFAULT_STATE: default state
      \arg        INVERT_STATE: invert the state
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_security_state_config(uint32_t tzbmpx, uint32_t sec_state)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);
    
    if(DEFAULT_STATE == sec_state){
        reg_value &= ~TZPCU_TZBMPC_CTL_SECSTATCFG;
    }else{
      if(INVERT_STATE == sec_state){
        reg_value |= TZPCU_TZBMPC_CTL_SECSTATCFG;
      }
    }

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure secure access state
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  sec_illaccess_state: secure illegal access state
                only one parameter can be selected which is shown as below:
      \arg        SECURE_ILLEGAL_ACCESS_ENABLE: secure read/write access non-secure SRAM is illegal
      \arg        SECURE_ILLEGAL_ACCESS_DISABLE: secure read/write access non-secure SRAM is legal
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_secure_access_config(uint32_t tzbmpx, uint32_t sec_illaccess_state)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_CTL configuration register */
    reg_value = TZPCU_TZBMPC_CTL(tzbmpx);

    if(SECURE_ILLEGAL_ACCESS_ENABLE == sec_illaccess_state){
        reg_value &= ~TZPCU_TZBMPC_CTL_SRWACFG;
    }else{
      if(SECURE_ILLEGAL_ACCESS_DISABLE == sec_illaccess_state){
        reg_value |= TZPCU_TZBMPC_CTL_SRWACFG;
      }
    }

    /* set TZSPC TZBMPC_CTL configuration register */
    TZPCU_TZBMPC_CTL(tzbmpx) = reg_value;
}

/*!
    \brief      configure block secure access mode
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  block_pos_num: block position number
                for TZBMPC0 and TZBMPC1 block position number is 0-255;
                for TZBMPC2 block position number is 0-511;
                for TZBMPC3 block position number is 0-799
    \param[in]  access_mode: block secure access mode
                only one parameter can be selected which is shown as below:
      \arg        BLOCK_SECURE_ACCESS_MODE_SEC: block secure access mode is secure
      \arg        BLOCK_SECURE_ACCESS_MODE_NSEC: block secure access mode is non-secure
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_block_secure_access_mode_config(uint32_t tzbmpx, uint32_t block_pos_num, uint32_t access_mode)
{
    uint32_t reg_value, integer, mod;

    integer = block_pos_num / 32U;
    mod = block_pos_num % 32U;
    /* get TZSPC TZBMPC_VEC configuration register */
    reg_value = TZPCU_TZBMPC_VEC(tzbmpx, integer);

    if(BLOCK_SECURE_ACCESS_MODE_SEC == access_mode){
        reg_value |= 1U << mod;
    }else{
      if(BLOCK_SECURE_ACCESS_MODE_NSEC == access_mode){
        reg_value &= ~(1U << mod );
      }
    }

    /* set TZSPC TZBMPC_VEC configuration register */
    TZPCU_TZBMPC_VEC(tzbmpx, integer) = reg_value;
}

/*!
    \brief      lock configure union block secure access mode
    \param[in]  tzbmpx: TZBMPCx(x=0,1,2,3)
    \param[in]  union_block_position_num: union block position number
                for TZBMPC0 and TZBMPC1 union block position number is 0-7;
                for TZBMPC2 union block position number is 0-15;
                for TZBMPC3 union block position number is 0-23
    \param[out] none
    \retval     none
*/
void tzpcu_tzbmpc_union_block_lock(uint32_t tzbmpx, uint32_t union_block_position_num)
{
    uint32_t reg_value;

    /* get TZSPC TZBMPC_LOCK1 configuration register */
    reg_value = TZPCU_TZBMPC_LOCK0(tzbmpx);

    reg_value |= 1U << union_block_position_num;

    /* set TZSPC TZBMPC_LOCK1 configuration register */
    TZPCU_TZBMPC_LOCK0(tzbmpx) = reg_value;
}

/*!
    \brief      enable illegal access interrupt
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral
      \arg        TZPCU_PERIPH_RTC: RTC peripheral
      \arg        TZPCU_PERIPH_PMU: PMU peripheral
      \arg        TZPCU_PERIPH_SYSCFG: SYSCFG peripheral
      \arg        TZPCU_PERIPH_DMA0: DMA0 peripheral
      \arg        TZPCU_PERIPH_DMA1: DMA1 peripheral
      \arg        TZPCU_PERIPH_RCU: RCU peripheral
      \arg        TZPCU_PERIPH_FLASH: FLASH peripheral
      \arg        TZPCU_PERIPH_FMC: FLASH REG peripheral
      \arg        TZPCU_PERIPH_EXTI: EXTI peripheral
      \arg        TZPCU_PERIPH_TZSPC: TZSPC peripheral
      \arg        TZPCU_PERIPH_TZIAC: TZIAC peripheral
      \arg        TZPCU_PERIPH_SRAM0: SRAM0 peripheral
      \arg        TZPCU_PERIPH_TZBMPC0_REG: ZBMPC0 register
      \arg        TZPCU_PERIPH_SRAM1: SRAM1 peripheral
      \arg        TZPCU_PERIPH_TZBMPC1_REG: TZBMPC1 register
      \arg        TZPCU_PERIPH_SRAM2: SRAM2 peripheral
      \arg        TZPCU_PERIPH_TZBMPC2_REG: TZBMPC2 register
      \arg        TZPCU_PERIPH_SRAM3: SRAM3 peripheral
      \arg        TZPCU_PERIPH_TZBMPC3_REG: TZBMPC3 register
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAM: SQPI_PSRAM peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASH: QSPI_FLASH peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral
      \arg        TZPCU_PERIPH_ALL: all peripherals
    \param[out] none
    \retval     none
*/
void tzpcu_tziac_interrupt_enable(uint32_t periph)
{
    uint32_t position = 0U, reg_value = 0U;

     if(TZPCU_PERIPH_ALL == (periph & TZPCU_PERIPH_ALL)){
        /* enable all interrupt */
        TZPCU_TZIAC_INTEN0 |= TZIAC_INTEN0_ALL;
        TZPCU_TZIAC_INTEN1 |= TZIAC_INTEN1_ALL;
        TZPCU_TZIAC_INTEN2 |= TZIAC_INTEN2_ALL;
    }else{
        /* get TZIAC_INTEN register value */
        reg_value = REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U));

        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

