CommunityGD32Cores/GD32Firmware/GD32W51x/GD32W51x_standard_peripheral/Source/gd32w51x_tzpcu.c
        reg_value |= position;

        /* set TZIAC_INTEN register value */
        REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U)) = reg_value;
    }
}

/*!
    \brief      disable illegal access interrupt
    \param[in]  periph: peripheral 
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_PERIPH_TIMER1: TIMER1 peripheral
      \arg        TZPCU_PERIPH_TIMER2: TIMER2 peripheral
      \arg        TZPCU_PERIPH_TIMER3: TIMER3 peripheral
      \arg        TZPCU_PERIPH_TIMER4: TIMER4 peripheral
      \arg        TZPCU_PERIPH_TIMER5: TIMER5 peripheral
      \arg        TZPCU_PERIPH_WWDGT: WWDGT peripheral
      \arg        TZPCU_PERIPH_FWDGT: FWDGT peripheral
      \arg        TZPCU_PERIPH_SPI1: SPI1 peripheral
      \arg        TZPCU_PERIPH_USART1: USART1 peripheral
      \arg        TZPCU_PERIPH_USART2: USART2 peripheral
      \arg        TZPCU_PERIPH_I2C0: I2C0 peripheral
      \arg        TZPCU_PERIPH_I2C1: I2C1 peripheral
      \arg        TZPCU_PERIPH_USBFS: USBFS peripheral
      \arg        TZPCU_PERIPH_TIMER0: TIMER0 peripheral
      \arg        TZPCU_PERIPH_SPI0: SPI0 peripheral
      \arg        TZPCU_PERIPH_USART0: USART0 peripheral
      \arg        TZPCU_PERIPH_TIMER15: TIMER15 peripheral
      \arg        TZPCU_PERIPH_TIMER16: TIMER16 peripheral
      \arg        TZPCU_PERIPH_HPDF: HPDF peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_CRC: CRC peripheral
      \arg        TZPCU_PERIPH_TSI: TSI peripheral
      \arg        TZPCU_PERIPH_ICACHE: ICACHE peripheral
      \arg        TZPCU_PERIPH_ADC: ADC peripheral
      \arg        TZPCU_PERIPH_CAU: CAU peripheral
      \arg        TZPCU_PERIPH_HAU: HAU peripheral
      \arg        TZPCU_PERIPH_TRNG: TRNG peripheral
      \arg        TZPCU_PERIPH_PKCAU: PKCAU peripheral
      \arg        TZPCU_PERIPH_SDIO: SDIO peripheral
      \arg        TZPCU_PERIPH_RTC: RTC peripheral
      \arg        TZPCU_PERIPH_PMU: PMU peripheral
      \arg        TZPCU_PERIPH_SYSCFG: SYSCFG peripheral
      \arg        TZPCU_PERIPH_DMA0: DMA0 peripheral
      \arg        TZPCU_PERIPH_DMA1: DMA1 peripheral
      \arg        TZPCU_PERIPH_RCU: RCU peripheral
      \arg        TZPCU_PERIPH_FLASH: FLASH peripheral
      \arg        TZPCU_PERIPH_FMC: FLASH REG peripheral
      \arg        TZPCU_PERIPH_EXTI: EXTI peripheral
      \arg        TZPCU_PERIPH_TZSPC: TZSPC peripheral
      \arg        TZPCU_PERIPH_TZIAC: TZIAC peripheral
      \arg        TZPCU_PERIPH_SRAM0: SRAM0 peripheral
      \arg        TZPCU_PERIPH_TZBMPC0_REG: ZBMPC0 REG peripheral
      \arg        TZPCU_PERIPH_SRAM1: SRAM1 peripheral
      \arg        TZPCU_PERIPH_TZBMPC1_REG: TZBMPC1 REG peripheral
      \arg        TZPCU_PERIPH_SRAM2: SRAM2 peripheral
      \arg        TZPCU_PERIPH_TZBMPC2_REG: TZBMPC2 REG peripheral
      \arg        TZPCU_PERIPH_SRAM3: SRAM3 peripheral
      \arg        TZPCU_PERIPH_TZBMPC3_REG: TZBMPC3 REG peripheral
      \arg        TZPCU_PERIPH_EFUSE: EFUSE peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAM: SQPI_PSRAM peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASH: QSPI_FLASH peripheral
      \arg        TZPCU_PERIPH_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_PERIPH_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_PERIPH_WIFI_RF: WIFI RF peripheral
      \arg        TZPCU_PERIPH_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_PERIPH_DCI: DCI peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_PERIPH_WIFI: WIFI peripheral
      \arg        TZPCU_PERIPH_ALL: all peripherals
    \param[in]  attributes: security and privilege attributes
                one or more parameters can be selected which are shown as below:
      \arg        TZPCU_SEC or TZPCU_NSEC
      \arg        TZPCU_PRIV or TZPCU_NPRIV
    \param[out] none
    \retval     none
*/
void tzpcu_tziac_interrupt_disable(uint32_t periph)
{
    uint32_t position = 0U, reg_value = 0U;

     if(0U != (periph & TZPCU_PERIPH_ALL)){
        /* disable all interrupt */
        TZPCU_TZIAC_INTEN0 &= ~TZIAC_INTEN0_ALL;
        TZPCU_TZIAC_INTEN1 &= ~TZIAC_INTEN1_ALL;
        TZPCU_TZIAC_INTEN2 &= ~TZIAC_INTEN2_ALL;
    }else{
        /* get TZIAC_INTEN register value */
        reg_value = REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U));

        position = periph & LSB_16BIT_MASK;
        if(periph & PERIPH_LOCATION_MASK){
            position = position << PERIPH_OFFSET;
        }

        reg_value &= ~position;

        /* set TZIAC_INTEN register value */
        REG32(TZIAC + ((periph >> PERIPH_REGNUM_POS ) << 2U)) = reg_value;
    }
}

/*!
    \brief      get illegal access interrupt flag
    \param[in]  periph_flag: peripheral interrupt flag
                only one parameter can be selected which is shown as below:
      \arg        TZPCU_TZIAC_FLAG_TIMER1: TIMER1 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER2: TIMER2 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER3: TIMER3 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER4: TIMER4 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER5: TIMER5 peripheral
      \arg        TZPCU_TZIAC_FLAG_WWDGT: WWDGT peripheral
      \arg        TZPCU_TZIAC_FLAG_FWDGT: FWDGT peripheral
      \arg        TZPCU_TZIAC_FLAG_SPI1: SPI1 peripheral
      \arg        TZPCU_TZIAC_FLAG_USART1: USART1 peripheral
      \arg        TZPCU_TZIAC_FLAG_USART2: USART2 peripheral
      \arg        TZPCU_TZIAC_FLAG_I2C0: I2C0 peripheral
      \arg        TZPCU_TZIAC_FLAG_I2C1: I2C1 peripheral
      \arg        TZPCU_TZIAC_FLAG_USBFS: USBFS peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER0: TIMER0 peripheral
      \arg        TZPCU_TZIAC_FLAG_SPI0: SPI0 peripheral
      \arg        TZPCU_TZIAC_FLAG_USART0: USART0 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER15: TIMER15 peripheral
      \arg        TZPCU_TZIAC_FLAG_TIMER16: TIMER16 peripheral
      \arg        TZPCU_TZIAC_FLAG_HPDF: HPDF peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_TZIAC_FLAG_CRC: CRC peripheral
      \arg        TZPCU_TZIAC_FLAG_TSI: TSI peripheral
      \arg        TZPCU_TZIAC_FLAG_ICACHE: ICACHE peripheral
      \arg        TZPCU_TZIAC_FLAG_ADC: ADC peripheral
      \arg        TZPCU_TZIAC_FLAG_CAU: CAU peripheral
      \arg        TZPCU_TZIAC_FLAG_HAU: HAU peripheral
      \arg        TZPCU_TZIAC_FLAG_TRNG: TRNG peripheral
      \arg        TZPCU_TZIAC_FLAG_PKCAU: PKCAU peripheral
      \arg        TZPCU_TZIAC_FLAG_SDIO: SDIO peripheral
      \arg        TZPCU_TZIAC_FLAG_RTC: RTC peripheral
      \arg        TZPCU_TZIAC_FLAG_PMU: PMU peripheral
      \arg        TZPCU_TZIAC_FLAG_SYSCFG: SYSCFG peripheral
      \arg        TZPCU_TZIAC_FLAG_DMA0: DMA0 peripheral
      \arg        TZPCU_TZIAC_FLAG_DMA1: DMA1 peripheral
      \arg        TZPCU_TZIAC_FLAG_RCU: RCU peripheral
      \arg        TZPCU_TZIAC_FLAG_FLASH: FLASH peripheral
      \arg        TZPCU_TZIAC_FLAG_FMC: FLASH REG peripheral
      \arg        TZPCU_TZIAC_FLAG_EXTI: EXTI peripheral
      \arg        TZPCU_TZIAC_FLAG_TZSPC: TZSPC peripheral
      \arg        TZPCU_TZIAC_FLAG_TZIAC: TZIAC peripheral
      \arg        TZPCU_TZIAC_FLAG_SRAM0: SRAM0 peripheral
      \arg        TZPCU_TZIAC_FLAG_TZBMPC0_REG: TZBMPC0 REG peripheral
      \arg        TZPCU_TZIAC_FLAG_SRAM1: SRAM1 peripheral
      \arg        TZPCU_TZIAC_FLAG_TZBMPC1_REG: TZBMPC1 REG peripheral
      \arg        TZPCU_TZIAC_FLAG_SRAM2: SRAM2 peripheral
      \arg        TZPCU_TZIAC_FLAG_TZBMPC2_REG: TZBMPC2 REG peripheral
      \arg        TZPCU_TZIAC_FLAG_SRAM3: SRAM3 peripheral
      \arg        TZPCU_TZIAC_FLAG_TZBMPC3_REG: TZBMPC3 REG peripheral
      \arg        TZPCU_TZIAC_FLAG_EFUSE: EFUSE peripheral
      \arg        TZPCU_TZIAC_FLAG_SQPI_PSRAM: SQPI_PSRAM peripheral
      \arg        TZPCU_TZIAC_FLAG_QSPI_FLASH: QSPI_FLASH peripheral
      \arg        TZPCU_TZIAC_FLAG_SQPI_PSRAMREG: SQPI PSRAMREG peripheral
      \arg        TZPCU_TZIAC_FLAG_QSPI_FLASHREG: QSPI FLASHREG peripheral
      \arg        TZPCU_TZIAC_FLAG_WIFI_RF: WIFI RF peripheral
      \arg        TZPCU_TZIAC_FLAG_I2S1_ADD: I2S1_ADD peripheral
      \arg        TZPCU_TZIAC_FLAG_DCI: DCI peripheral(not support on GD32W515TX series devices)
      \arg        TZPCU_TZIAC_FLAG_WIFI: WIFI peripheral
    \param[out] none
    \retval     NO_ILLEGAL_ACCESS_PENDING or ILLEGAL_ACCESS_PENDING
*/
uint32_t tzpcu_tziac_flag_get(uint32_t periph_flag)
{
    uint32_t position = 0U, reg_value = 0U, flag_status = 0U;

    /* get TZPCU_TZIAC_STAT0 register value */
    reg_value = REG32((uint32_t)(&TZPCU_TZIAC_STAT0) + ((periph_flag >> PERIPH_REGNUM_POS ) << 2U));

    position = periph_flag & LSB_16BIT_MASK;
    if(periph_flag & PERIPH_LOCATION_MASK){
        position = position << PERIPH_OFFSET;
    }

